IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE.

PROCEDURE DIVISION.
MOVE 10 TO WS-A.
COMPUTE WS-B = WS-A * 2.
IF WS-B > 15
MOVE 999 TO WS-B
END-IF.
STOP RUN.
